/* 2025年度 プログラミング応用演習 第2回 演習プログラム(1) - PAE02_exer1
====================================================================================================
■キー入力された2整数x,yを四則演算するプログラム
・0除算となる場合は計算せず，エラーを表示して終了するようにせよ．
==================================================================================================*/
#include <iostream>
using namespace std;
int main(void)
{
    /* 2整数を格納する変数(int型)の定義 */
    int   x, y;

    /* キー入力された値を2整数に格納する */
    cout << ">>>x=";
    cin >> x;
    cout << ">>>y=";
    cin >> y;
    /* 四則演算と演算結果の表示(0での除算をエラーとする) */
    cout << "x+y=" << x + y << endl;
    cout << "x-y=" << x - y << endl;
    cout << "x*y=" << x * y << endl;
    /* 0除算のチェック */
    if (y == 0) {
        cout << "Error: 0除算" << endl;
    }
    else {
        cout << "x/y=" << x / y;
    }
    return 0;
}


/* 実行結果 ========================================================================================

[2数が5と3の場合]
>>>x=5
>>>y=3
x+y=8
x-y=2
x*y=15
x/y=1
----------------------------------------------------------------------------------------------------
[0除算の場合]
>>>x=6
>>>y=0
x+y=6
x-y=6
x*y=0
Error: 0除算
==================================================================================================*/
