/* 2025年度 プログラミング応用演習 第2回 演習プログラム(2) - PAE02_exer2
====================================================================================================
■要素10個のデータ列の最大値と最小値を求めるプログラム
・データ列に関し，「#if 1」の場合と，「#if 0」の場合で動作確認すること．
・要素アクセスには，反復子を用いること．
==================================================================================================*/
#include <iostream>
#include <vector>
using namespace std;
int main(void)
{
    /* データ列(要素を変更しないこと) */
#if 1
    std::vector<int>   data = { 2,  3, -8,  7, 0,  1, -5,  9,  6,  4 };   /* データ列1 */
#else
    std::vector<int>   data = { -2, -3, -8, -7, 0, -1, -5, -9, -6, -4 };   /* データ列2 */
#endif

    // int型のベクトルに対する反復子
    std::vector<int>::iterator   itr;

    /* 最大値・最小値及びその位置を格納する変数 */
    int   max_value, max_idx;
    int   min_value, min_idx;

    /* 最大値・最小値の初期化 */
    max_value = data[0];
    max_idx = 0;
    min_value = data[0];
    min_idx = 0;
    /* 最大値・最小値を求めるループ */
    for (itr = data.begin()+1;itr != data.end();++itr) {
        if (*itr > max_value) {
            max_value = *itr;
            max_idx = distance(data.begin(), itr);
        }
        else if (*itr < min_value) {
            min_value = *itr;
            min_idx = distance(data.begin(), itr);
        }
    }
    /* 結果の表示 */
    cout << "最大値:" << max_value << endl;
    cout << "最小値:" << min_value << endl;

    return 0;
}


/* 実行結果 ========================================================================================

[データ列1の場合]
最大値:9
最小値:-8
----------------------------------------------------------------------------------------------------
[データ列2の場合]
最大値:0
最小値:-9
==================================================================================================*/
