/* 2025年度 プログラミング応用演習 第10回 演習プログラム(1) - PAE10_exer1
====================================================================================================
■最大値mのデータに必要なビット長Nを求めるプログラム
==================================================================================================*/
#include <iostream>
#include <cmath>
//==================================================================================================
int main(void)
{
    int   m;        // データの最大値
    int   N = 1;    // 必要ビット長(最小は1)
    int   a, b;     // Nビット，N+1ビットの最大値

    // データの最大値をキー入力し，mに格納する．
    std::cout << "データの最大値: ";
    std::cin >> m;

    // 必要ビット長を求める．
    for (N = 1;pow(2, N) < m;N++) {};
    // 必要ビット長Nを表示する．
    std::cout << "必要ビット長: " << N << std::endl;

    return 0;
}


/* 実行結果 ========================================================================================
[データ最大値が12の場合]
データの最大値: 12
必要ビット長: 4
[データ最大値が192の場合]
必要ビット長: 8
[データ最大値が34567の場合]
データの最大値: 34567
必要ビット長: 16
==================================================================================================*/
