/* 2025年度 プログラミング応用演習 第1回 演習プログラム(2) - PAE01_exer2
====================================================================================================
■要素10個のデータ列の最大値と最小値を求めるプログラム
・データ列に関し，「#if 1」の場合と，「#if 0」の場合で動作確認すること．
==================================================================================================*/
#include <stdio.h>

int main(void)
{
    /* データ列(要素を変更しないこと) */
#if 1
    int data[10] = { 2,  3, -8,  7, 0,  1, -5,  9,  6,  4 };   /* データ列1 */
#else
    int data[10] = { -2, -3, -8, -7, 0, -1, -5, -9, -6, -4 };   /* データ列2 */
#endif

    /* 最大値・最小値を格納する変数 */
    int   max_value;
    int   min_value;

    int   i;

    /* 最大値・最小値の初期化 */
    max_value = data[0];
    min_value = data[0];

    /* 最大値・最小値を調べる */
    for (i = 1;i < 10;i= i+1) {
        if (max_value < data[i]) {
            max_value = data[i];
        }
        else if (min_value > data[i]) {
            min_value = data[i];
        }
    }

    /* 結果の表示 */
    printf("最大値は%d\n", max_value);
    printf("最小値は%d\n", min_value);

    return 0;
}


/* 実行結果 ========================================================================================
[データ列1の場合]
最大値は9
最小値は-8
----------------------------------------------------------------------------------------------------
[データ列2の場合]
最大値は0
最小値は-9
==================================================================================================*/
