/* 2025年度 プログラミング応用演習 第1回 演習プログラム(1) - PAE01_exer1
====================================================================================================
■キー入力された2整数x,yを四則演算するプログラム
・0除算となる場合は計算せず，エラーを表示して終了するようにせよ．
==================================================================================================*/
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int main(void)
{
    /* 2整数を格納する変数(int型)の定義 */
    int   x, y;
  
    /* キー入力された値を2整数に格納する */
    printf(">>>x = ");
    scanf("%d", &x);
    printf(">>>y = ");
    scanf("%d",&y);
    /* 四則演算と演算結果の表示(0での除算をエラーとする) */
    printf("\n四則演算結果\n");
    printf("x+y=%d\n", x + y);
    printf("x-y=%d\n", x - y);
    printf("x*y=%d\n", x * y);
    /* 0除算のチェック */
    if (y != 0) {
        printf("x/y=%d\n", x / y);
    }
    else {
        printf("Error:0除算\n");
    }
    return 0;
}

/* 実行結果 ========================================================================================

[2数が5と3の場合]
>>>x = 5
>>>y = 3

四則演算結果
x+y=8
x-y=2
x*y=15
x/y=1




----------------------------------------------------------------------------------------------------
[0除算の場合]
>>>x = 8
>>>y = 0

四則演算結果
x+y=8
x-y=8
x*y=0
Error:0除算
==================================================================================================*/
