/* 2025年度 プログラミング応用演習 第7回 演習プログラム(3) - PAE07_exer3
====================================================================================================
■平方根を求めるプログラム
・乱数を用いて√xを求める．
==================================================================================================*/
#define _USE_MATH_DEFINES
#include <iostream>
#include <random>
#include <cmath>
#include <ctime>

//---------------------------------------------------------------
// √xを求める．
double extract_sqrt2(double x, int T)
{
    std::random_device   device;
    std::mt19937    gen(device());
    std::uniform_real_distribution<>     rnd(0, 1);    // 区間[0,1]の実数一様分布乱数

    int      S = 0;
    double   r;
    double   sqrt_x;     // 求めた√xの値

    for (int i = 0; i < T; i++) {
        // 区間[0,2]の一様分布
        r = rnd(gen) * 2;

        // r^2が2より小さい場合カウント
        if(r*r <= x){
            S++;
        }
    }

    // √xを求める．
    sqrt_x = 2.0 * S / T;

    return double(sqrt_x);
}

//==================================================================================================
int main(void)
{
    int      MAX_TRIAL = 100000000;      // 試行回数
    double   sqrt_a;
    double   a = 3;

    clock_t  t0, t1, tt;     // 処理開始時刻[ms]，処理終了時刻[ms]，処理時間[ms]

    // 理論値(関数sqrtの値)を表示する．
    std::cout << "√" << a << " = " << std::sqrt(a) << " (理論値：sqrt(a))" << std::endl;

    // ランダムな点の数を10000からMAX_TRIALまで変更し，√aを求める．
    for (int i = 10000; i <= MAX_TRIAL; i *= 10) {
        // √aを求め表示する．
        t0 = std::clock();      // 関数の開始時刻を取得
        sqrt_a = extract_sqrt2(a, i);
        t1 = std::clock();      // 関数の終了時刻を取得
        tt = t1 - t0;       // 関数の実行時間を計算

        std::cout << "√" << a << " = " << sqrt_a << " (試行回数=" << i << "), t=";
        std::cout << tt << " [ms]" << std::endl;
    }

    return 0;
}


/* 実行結果 ========================================================================================
√3 = 1.73205 (理論値：sqrt(a))
√3 = 1.727 (試行回数=10000), t=2 [ms]
√3 = 1.73194 (試行回数=100000), t=3 [ms]
√3 = 1.73155 (試行回数=1000000), t=27 [ms]
√3 = 1.73206 (試行回数=10000000), t=269 [ms]
√3 = 1.732 (試行回数=100000000), t=2676 [ms]
==================================================================================================*/

