/* 2025年度 プログラミング応用演習 第7回 演習プログラム(2) - PAE07_exer2
====================================================================================================
■半径1の球の体積を求めるプログラム
・辺の長さ1の立方体と，半径1の円の1/8(第1象限)におけるランダムな点の数の比によって球の体積を求める．
==================================================================================================*/
#define _USE_MATH_DEFINES
#include <iostream>
#include <vector>
#include <cstdlib>
#include <cmath>
#include <ctime>

//---------------------------------------------------------------
// 区間[0,1]の一様乱数を生成する．
double urand(void)
{
    return (double)rand() / RAND_MAX;
}

//---------------------------------------------------------------
// モンテカルロ法によって体積を計算する．
double calc_volume(int T)
{
    int     S = 0;      // 円の内側の点の数
    double  x, y, z;    // ランダムな座標(0～1)

    // T個の点を打ち，円の内部に入った点を数える．
    for (int i = 0; i < T; i++) {

        // 第1象限の[0,1]の範囲の座標を乱数で決める．
        x = urand();
        y = urand();
        z = urand();

        // 半径1の円の第1象限部分の1/4部分に入っている場合カウントする．
        if (x * x + y * y + z * z <= 1) {
            S++;
        }
    }

    // 求めた体積を返す．
    return (double)8 * S / T;
}

//==================================================================================================
int main(void)
{
    int     MAX_TRIAL = 100000000;      // 全点の数
    double  v;     // 求めた体積

    clock_t  t0, t1, tt;     // 処理開始時刻[ms]，処理終了時刻[ms]，処理時間[ms]

    std::srand(std::time(NULL));

    // 理論値(4/3*M_PI)を表示する．
    std::cout << "V = " << 4.0 / 3.0 * M_PI << "  (理論値：4/3π r^3)" << std::endl;

    // ランダムな点の数を10000からMAX_TRIALまで変更し，球の体積を求める．
    for (int i = 10000; i <= MAX_TRIAL; i *= 10) {
        // 球の体積を求めて表示する．
        t0 = std::clock();      // 関数の開始時刻を取得
        v = calc_volume(i);
        t1 = std::clock();      // 関数の終了時刻を取得
        tt = t1 - t0;       // 関数の実行時間を計算

        std::cout << "V = " << v << "  (試行回数=" << i << "), t=";
        std::cout << tt << " [ms]" << std::endl;
    }

    return 0;
}


/* 実行結果 ========================================================================================
V = 4.18879  (理論値：4/3π r^3)
V = 4.1352  (試行回数=10000), t=0 [ms]
V = 4.18608  (試行回数=100000), t=6 [ms]
V = 4.18641  (試行回数=1000000), t=56 [ms]
V = 4.18886  (試行回数=10000000), t=553 [ms]
V = 4.18905  (試行回数=100000000), t=5535 [ms]
==================================================================================================*/
