/* 2025年度 プログラミング応用演習 第7回 演習プログラム(1) - PAE07_exer1
====================================================================================================
■円と正方形の面積比によってπを求めるプログラム
・辺の長さ1の正方形と，半径1の円の1/4(第1象限)におけるランダムな点の数の比によってπを求める．
==================================================================================================*/
#define _USE_MATH_DEFINES
#include <iostream>
#include <vector>
#include <cstdlib>
#include <ctime>
#include <cmath>

//---------------------------------------------------------------
// 区間[0,1]の一様分布乱数を生成する．
double urand(void)
{
    return (double)rand() / RAND_MAX;
}

//---------------------------------------------------------------
// モンテカルロ法によってπを計算する．
double calc_pi(int T)
{
    int     S = 0;     // 円の内側の点の数
    double  x, y;      // ランダムな座標(0～1)

    // T個の点を打ち，円の内部に入った点を数える．
    for (int i = 0; i < T; i++) {
        // 第1象限の区間[0,1]の座標を乱数で決める．
        x = urand();
        y = urand();
        // 半径1の円の第1象限部分の1/4部分に入っている場合，カウントする．
        if (x*x+y*y<=1) {
            S++;
        }
    }

    // 求めたπを返す．
    return 4.0*S / T;
}

//--------------------------------------------------------------------------------------------------
int main(void)
{
    int     MAX_TRIAL = 100000000;      // 全点の数
    double  pi;     // 求めたπの値

    clock_t  t0, t1, tt;     // 処理開始時刻[ms]，処理終了時刻[ms]，処理時間[ms]

    std::srand(std::time(NULL));

    // 理論値(cmathのM_PI)を表示する．
    std::cout << "π = " << M_PI << "  (M_PIの値)" << std::endl;

    // ランダムな点の数を10000からMAX_TRIALまで変更し，楕円の面積を求める．
    for (int i = 10000; i <= MAX_TRIAL; i *= 10) {
        // πを求めて表示する．
        t0 = std::clock();      // 関数の開始時刻を取得
        pi = calc_pi(i);
        t1 = std::clock();      // 関数の終了時刻を取得
        tt = t1 - t0;       // 関数の実行時間を計算

        std::cout << "π = " << pi << "  (試行回数=" << i << "), t=";
        std::cout << tt << " [ms]" << std::endl;
    }

    return 0;
}


/* 実行結果 ========================================================================================
π = 3.14159  (M_PIの値)
π = 3.1084  (試行回数=10000), t=0 [ms]
π = 3.14228  (試行回数=100000), t=4 [ms]
π = 3.142  (試行回数=1000000), t=37 [ms]
π = 3.14171  (試行回数=10000000), t=368 [ms]
π = 3.14163  (試行回数=100000000), t=3677 [ms]
==================================================================================================*/
