/* 2025年度 プログラミング応用演習 第7回 演習プログラム(2) - PAE07_exer2
====================================================================================================
■重複なく区間[0, 9]のランダムな整数の配列を作成するプログラム
・乱数の扱いは，cstdlib+ctime，randomどちらでもよい．
・0～9を順番に並べた配列の要素をランダムに入れ替える．
  例えば，乱数により0～9番目の要素を選び，その隣の要素間で入れ替える．
※同様の処理をしてくれるライブラリがあるかもしれないが，乱数の扱いの練習なので，そのようなライブラリ
  は使わないこと．
==================================================================================================*/
#include <iostream>
#include <vector>
#include <random>
using namespace std;
//==================================================================================================
int main(void)
{
  // 乱数関係の準備
  random_device rd;
  mt19937 mt(rd());
  uniform_int_distribution<int> dist(0,9);

  // [0, 9]の数字列を記憶する配列
  std::vector<int>    v(10);

  int   idx0, idx1;
  int   t;

  // 要素を，要素番号と同じ値(0,1,2,～,8,9)で初期化する．
  for (int i = 0;v.size() > i;i++){
    v[i] = i;
  }

  // 隣りあった要素を入れ替えることで100回シャッフルする．
  for(int i=0; i<100; i++) {
    idx0 = dist(mt);
    idx1 = dist(mt);
    t = v[idx0];
    v[idx0] = v[idx1];
    v[idx1] = t;
  }

  // 配列の全要素を表示する．
  for(int i=0; i<10; i++) {
      std::cout << v[i] << std::endl;
  }

  return 0;
}


/* 実行結果 ========================================================================================
1
0
8
7
2
4
6
3
9
5
==================================================================================================*/
