/* 2025年度 プログラミング応用演習 第7回 演習プログラム(1) - PAE07_exer1
====================================================================================================
■三目並べ(○×)ゲームのプログラム
・第1回課題レポートプログラム(1)で，両プレーヤーとも乱数でマーク位置を決めるようにする．
・乱数ライブラリは，cstdlib+ctimeとする．
- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
ToDo：余裕があれば，先攻(O)はキー入力し後攻(X)は乱数として，対戦型にしてみる．
==================================================================================================*/
//
// 第1回課題レポートプログラム(1)を貼り付けて，変更すること．
//
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <cstdlib>
#include <ctime>

//--------------------------------------------------------------------------------------------------
int main(void)
{
	int t = time(NULL);
	srand(t);
	char  board[3][3] = {       /* 盤面(初期値は全て空白' ') */
            {' ', ' ', ' '},
            {' ', ' ', ' '},
            {' ', ' ', ' '}
        };
    char  mark[2] = {'O', 'X'};    /* プレーヤーのマーク(O:先攻,  X:後攻 */
    int   player = 0;              /* プレーヤー番号(0:先攻, 1:後攻) */
    int   cnt_x, cnt_y;            /* マーク並び数カウンタ(縦横) */
    int   cnt_d, cnt_a;            /* マーク並び数カウンタ(斜め) */
    int   cnt_s;                   /* 空白のマスカウンタ */
    int   winner = -1;             /* 勝者(-1:未定，0:先攻, 1:後攻, 2:引き分け) */
    int   x, y;                    /* マークする座標キー入力 */
    int   i, j;

    /* ゲームループ */
    while( 1 ) {
        /* ボードを描く */
        printf("  | 1 | 2 | 3\n");      /* 横座表 */
        for(i=0; i<3; i++) {
            printf("--+---+---+---\n%d ", i+1);     /* 水平罫線と縦座標 */
            for(j=0; j<3; j++) {
                printf("| %c ", board[i][j]);       /* 各マス */
            }

            printf("\n");   /* 行終了 */
        }

        /* 終了(勝敗・引き分けが決したか否か)判定．終了ならこのループを終了する． */
        if (winner != -1) {
            break;
        }

        /* 'O'/'X'マーク位置を入力し，チェックする．*/
        while(1) {              /* 正しく入力されるまで繰り返し */
            /* 座標をキー入力: x,y値をカンマ区切りで入力 */
			x = rand() % 3;
			y = rand() % 3;
            printf(">>> Player-%d: %d,%d\n ", player+1,x+1,y+1);
            /* 入力チェック: x,y値の範囲，マーク済みか否か．問題なければこのループを終了する．
               エラーメッセージは講義資料の実行結果例を参照すること．
            */
            if (x < 0 || x > 2) {
                printf("Error: x={1,2,3}\n");
                while (getchar() != '\n');
                continue;
            }
            if (y < 0 || y > 2) {
                printf("Error: y={1,2,3}\n");
                while (getchar() != '\n');
                continue;
            }
            if (board[y][x] == 'O'||board[y][x] == 'X') {
                printf("Error: '%c' at (%d,%d)\n", board[y][x], x+1, y+1);
                continue;
            }
            break;
        }
        /* 盤面のx,y座標にマーク */
        board[y][x] = mark[player];

        /* 勝敗判定: 縦横斜めで3マス並びがあったら勝者(winner)をプレーヤー(player)に設定 */
        for (i = 0; i < 3; i++) {
            if (board[i][0] == mark[player] && board[i][1] == mark[player] && board[i][2] == mark[player]) winner = player;
            if (board[0][i] == mark[player] && board[1][i] == mark[player] && board[2][i] == mark[player]) winner = player;
        }
        if (board[0][0] == mark[player] && board[1][1] == mark[player] && board[2][2] == mark[player]) winner = player;
        if (board[0][2] == mark[player] && board[1][1] == mark[player] && board[2][0] == mark[player]) winner = player;

        if (winner == -1) {
            cnt_s = 0;
            for (i = 0; i < 3; i++) {
                for (j = 0; j < 3; j++) {
                    if (board[i][j] == ' ') {
                        cnt_s++;
                    }
                }
            }
            if (cnt_s == 0) {
                winner = 2;
            }
        }

        /* プレーヤー交代: playerが1なら0，0なら1にできる */
        if(winner == -1) {
            player = 1 - player;
        }
    }

    /* 結果表示 */
    if(winner == 2) {
        /* 引き分け */
        printf("###\n### Draw.\n###\n");
    } else {
        /* 勝者を表示 */
        printf("###\n### Winner: Player-%d\n###\n", winner+1);
    }

	return 0;
}


/* 実行結果 ========================================================================================
  | 1 | 2 | 3
--+---+---+---
1 |   |   |
--+---+---+---
2 |   |   |
--+---+---+---
3 |   |   |
>>> Player-1: 1,3
   | 1 | 2 | 3
--+---+---+---
1 |   |   |
--+---+---+---
2 |   |   |
--+---+---+---
3 | O |   |
>>> Player-2: 1,3
 Error: 'O' at (1,3)
>>> Player-2: 2,3
   | 1 | 2 | 3
--+---+---+---
1 |   |   |
--+---+---+---
2 |   |   |
--+---+---+---
3 | O | X |
>>> Player-1: 3,1
   | 1 | 2 | 3
--+---+---+---
1 |   |   | O
--+---+---+---
2 |   |   |
--+---+---+---
3 | O | X |
>>> Player-2: 3,1
 Error: 'O' at (3,1)
>>> Player-2: 2,1
   | 1 | 2 | 3
--+---+---+---
1 |   | X | O
--+---+---+---
2 |   |   |   
--+---+---+---
3 | O | X |
>>> Player-1: 1,3
 Error: 'O' at (1,3)
>>> Player-1: 2,3
 Error: 'X' at (2,3)
>>> Player-1: 1,2
   | 1 | 2 | 3
--+---+---+---
1 |   | X | O
--+---+---+---
2 | O |   |
--+---+---+---
3 | O | X |
>>> Player-2: 1,2
 Error: 'O' at (1,2)
>>> Player-2: 1,1
   | 1 | 2 | 3
--+---+---+---
1 | X | X | O
--+---+---+---
2 | O |   |
--+---+---+---
3 | O | X |
>>> Player-1: 1,1
 Error: 'X' at (1,1)
>>> Player-1: 3,3
   | 1 | 2 | 3
--+---+---+---
1 | X | X | O
--+---+---+---
2 | O |   |
--+---+---+---
3 | O | X | O
>>> Player-2: 1,2
 Error: 'O' at (1,2)
>>> Player-2: 3,3
 Error: 'O' at (3,3)
>>> Player-2: 1,1
 Error: 'X' at (1,1)
>>> Player-2: 3,2
   | 1 | 2 | 3
--+---+---+---
1 | X | X | O
--+---+---+---
2 | O |   | X
--+---+---+---
3 | O | X | O
>>> Player-1: 2,3
 Error: 'X' at (2,3)
>>> Player-1: 2,2
   | 1 | 2 | 3
--+---+---+---
1 | X | X | O
--+---+---+---
2 | O | O | X
--+---+---+---
3 | O | X | O 
###
### Winner: Player-1
###
==================================================================================================*/

