/* 2025年度 プログラミング応用演習 第7回 課題プログラム(1) - PAE07_repo1
====================================================================================================
■ひとり双六プログラム
・サイコロは出したい目を入力し，乱数によって-2～2でずれるものとする．
  乱数を加えて1～6外になった場合，6の次は1，1の前は6で循環する．
・盤面を配列で表現し，個々の要素は，0は通常のマス，負値は「戻る」のマス，正値「進む」のマスとする．
・丁度ゴール位置でなくてもよい．例)ゴールの一マス前で2以上が出てもゴールとする．
==================================================================================================*/
#include <iostream>
#include <random>
using namespace std;
// 盤面を表示する．
// rt: 盤面を記憶する配列
// p: プレーヤーの現在の位置
void show_route(std::vector<int> rt, int p)
{
    for(int i=0; i<rt.size(); i++) {
        if(p == i) {
            std::cout << "P";   // プレーヤー
        } else if(rt[i] < 0) {
            std::cout << "<";   //「戻る」マス
        } else if(rt[i] > 0) {
            std::cout << ">";   //「進む」マス
        } else {
            std::cout << ".";   // 通常のマス
        }
    }

    std::cout << std::endl;
}

//==================================================================================================
int main(void)
{
    // 乱数関係クラスのオブジェクト
    std::random_device   device;
    std::mt19937    generator(device());
    std::uniform_int_distribution<>     rnd(-2, 2);    // 整数一様分布

    // 盤面を記憶する配列
    // 数値は止まったマスでの「戻る」「進む」数
    std::vector<int>   route = {
        0, 0, 6, 0, 0, -2, 0, 0, 0, 3, 0, 0, 0, -2, 0, 3, 0, 0, 0, 0, -4, 0, -6, 0, 0
    };

    int   dice;           // サイコロの目
    int   count = 0;      // サイコロを振った回数
    int   player = 0;     // プレーヤーの位置

    int   goal = route.size() - 1;      // ゴールの位置

    // 初期状態の盤面を表示する．
    show_route(route, player);

    // ゲームループ
    while(1) {
        //--------------------------------------
        // サイコロを振る．
        count++;
        // 出てほしいサイコロの目を入力する(1～6以外は再入力)．
        do {
            cout << "Dice: ";
            cin >> dice;
        } while((dice < 1) || (dice > 6));


        // キー入力した出てほしい目に乱数(-2～2)を足す．
        dice = dice + rnd(generator);


        // サイコロの目なので，1～6に制限する．6の次は1，1の前は6のように循環する．
        if(dice > 6){
            dice -=6;
        } else if (dice < 1) { // ★追加: 1未満の場合の処理
            dice += 6; // 例: 0 -> 6, -1 -> 5
        }

        // 乱数を加えた目を表示する．
        std::cout << "  --> " << dice;

        //--------------------------------------
        // プレーヤーを移動する(現在位置＋サイコロの目)．
        player += dice;

        // 丁度ゴールにならない(ゴールを越えた)場合もゴールとする．
        if (player > goal) {
            player = goal;
}
        // 止まったマスによって「戻る」「進む」を表示する．
        if(route[player] < 0) {
            std::cout << "  (" << -route[player] << " 戻る)";
        } else if(route[player] > 0) {
            std::cout << "  (" <<  route[player] << " 進む)";
        }
        std::cout << std::endl;

        // マスの「戻る」「進む」に従ってプレーヤーを移動する．
        player += route[player];

        //--------------------------------------
        // プレーヤー移動後の盤面を表示する．
        show_route(route, player);

        // プレーヤーの位置がゴールに到達したら，ループを終了する．
        if (goal <= player){
            break;
        }
    }

    //--------------------------------------
    // ゴール処理
    std::cout << std::endl;
    std::cout << count << "回目でゴール!" << std::endl;

    return 0;
}


/* 実行結果 ========================================================================================
P.>..<...>...<.>....<.<..
Dice: 2
  --> 3
..>P.<...>...<.>....<.<..
Dice: 4
  --> 5
..>..<..P>...<.>....<.<..
Dice: 4
  --> 4
..>..<...>..P<.>....<.<..
Dice: 4
  --> 4
..>..<...>...<.>P...<.<..
Dice: 4
  --> 2
..>..<...>...<.>..P.<.<..
Dice: 4
  --> 3
..>..<...>...<.>....<P<..
Dice: 4
  --> 5
..>..<...>...<.>....<.<.P

7回目でゴール!
==================================================================================================*/
