/* 2025年度 プログラミング応用演習 第10回 演習プログラム(1) - PAE10_exer1
====================================================================================================
■講義資料演習1のグラフを隣接行列・隣接リストとして定義し， サンプルプログラム(1.1)，(2.1)と同様に，
  辺の有無をチェックするプログラム
・配列E_mtxの初期化子をサンプルプログラム(1.1)に倣って記述する．
・隣接リストE_lstをサンプルプログラム(2.1)に倣って作成する．
==================================================================================================*/
#include <iostream>
#include <list>
#include <vector>

// 頂点情報
class Vertex {
public:
    int     id;
    // 頂点の番号
    double  val;    // 頂点へ至る辺の値

    // コンストラクタ
    Vertex(int i, double v) : id(i), val(v) {}
};
//==================================================================================================
int main(void)
{
    // 隣接行列の定義(非0:辺が存在する, 0:辺が存在しない)
    std::vector<std::vector<double>>    E_mtx = {
        { 0,12, 0, 0, 0, 0, 0},
        {12, 0,11, 0, 0, 0, 0},
        { 0,11, 0,10, 0, 0, 0},
        { 0, 0,10, 0,18, 0, 0},
        { 0, 0, 0,18, 0, 9, 0},
        { 0, 9, 0,20, 9, 0,10},
        { 0, 0, 0, 0, 0,10, 0}
    };
    // 隣接リスト(連結リストの配列)
    std::vector<std::list<Vertex>>      E_lst;
    std::list<Vertex>::iterator         ite;      // 反復子

    bool    exist;
    // 辺の有無．有(true)，無(false)
    int     I, J;

    // 隣接リストの要素数を隣接行列のサイズに変更する．
    E_lst.resize(E_mtx.size());
    //------------------------------------------------
    // 隣接リストの作成
    for(int i=0; i<(int)E_mtx.size(); i++) {
        for(int j=0; j<(int)E_mtx[i].size(); j++) {
            if(E_mtx[i][j] > 0) {
                E_lst[i].push_back(Vertex(j, E_mtx[i][j]));
            }
        }
    }

    //------------------------------------------------
    // 2頂点(vi,vj)の番号を入力する．
    std::cout << "2頂点の番号: ";
    std::cin >> I >> J;

    //------------------------------------------------
    // 隣接行列から辺(vi,vj)が存在するか否か確認する．
    std::cout << "隣接行列　：辺(v" << I << ",v" << J << ")は存在";
    if(E_mtx[I][J] > 0) {
        std::cout << "する．辺の値：" << E_mtx[I][J] << std::endl;
    } else {
        std::cout << "しない．" << std::endl;
    }

    //------------------------------------------------
    // 隣接リストから辺(vi,vj)が存在するか否か確認する．
    std::cout << "隣接リスト：辺(v" << I << ",v" << J << ")は存在";

    // I番目の連結リストから要素の値がJのものを検索する．
    // 辺がある場合はexistがtrue，無い場合はfalseになるようにプログラムする．
    exist = false;
    for(ite=E_lst[I].begin(); ite!=E_lst[I].end(); ite++) {
        if(ite->id == J) {
            exist = true;
            break;
        }
    }

    if(exist == true) {
        std::cout << "する．辺の値：" << ite->val << std::endl;
    } else {
        std::cout << "しない．" << std::endl;
    }

    return 0;
}
/* 実行結果 ========================================================================================

[頂点v0とv1の場合]
2頂点の番号: 0 1
隣接行列　：辺(v0,v1)は存在する．辺の値：12
隣接リスト：辺(v0,v1)は存在する．辺の値：12
----------------------------------------------------------------------------------------------------
[頂点v2とv5の場合]
2頂点の番号: 2 5
隣接行列　：辺(v2,v5)は存在しない．
隣接リスト：辺(v2,v5)は存在しない．
==================================================================================================*/
