/* 2025年度 プログラミング応用演習 第10回 演習プログラム(2) - PAE10_exer2
====================================================================================================
■講義資料演習2のグラフの隣接行列を定義し，隣接リストに変換するプログラム
・講義資料の実行結果に倣って，隣接リストを表示する．
==================================================================================================*/
#include <iostream>
#include <list>
#include <vector>

// 頂点情報
class Vertex {
public:
    int     id;
    // 頂点の番号
    double  val;    // 頂点へ至る辺の値

    // コンストラクタ
    Vertex(int i, double v) : id(i), val(v) {}
};
//==================================================================================================
int main(void)
{
    // 隣接行列(非0:辺が存在する, 0:辺が存在しない)
    std::vector<std::vector<double>>    E_mtx = {
        {0, 4, 1, 0, 0, 0},
        {4, 0, 2, 3, 0, 0},
        {1, 2, 0, 1, 3, 3},
        {0, 3, 1, 0, 1, 0},
        {0, 0, 3, 1, 0, 2},
        {0, 0, 3, 0, 2, 0}
    };
    // 隣接リスト(連結リストの配列)
    std::vector<std::list<Vertex>>    E_lst;
    std::list<Vertex>::iterator       ite;
    // 頂点数
    int     vcount = E_mtx.size();;

    //------------------------------------------------
    // 隣接行列から隣接リストを作成する．
    E_lst.resize(vcount);
    for(int i=0; i<vcount; i++) {
        for(int j=0; j<vcount; j++) {
            if(E_mtx[i][j] > 0) {
                E_lst[i].push_back(Vertex(j, E_mtx[i][j]));
            }
        }
    }

    //------------------------------------------------
    // 隣接リストを表示する．
    for(int i=0; i<vcount; i++) {
        std::cout << "v" << i;
        // i番目の連結リストの要素を反復子を用いて表示する．
        for(ite=E_lst[i].begin(); ite!=E_lst[i].end(); ite++) {
            std::cout << " -> v" << ite->id << "|" << ite->val;
        }

        std::cout << std::endl;
    }

    return 0;
}

/* 実行結果 ========================================================================================
v0 -> v1|4 -> v2|1
v1 -> v0|4 -> v2|2 -> v3|3
v2 -> v0|1 -> v1|2 -> v3|1 -> v4|3 -> v5|3
v3 -> v1|3 -> v2|1 -> v4|1
v4 -> v2|3 -> v3|1 -> v5|2
v5 -> v2|3 -> v4|2
==================================================================================================*/
