/* 2025年度 プログラミング応用演習 第3回 演習プログラム(2) - PAE03_exer2
====================================================================================================
■引数の異なる3種類のsum関数オーバーロードを実験するプログラム
・(1)～(3)の関数を実装しmainから呼び出して挙動を確認する．
==================================================================================================*/
#include <iostream>
#include <string>
#include <vector>
using namespace std;
// (1) 二つの整数を引数で受け取り，その和を返す関数 sum
void sum(int a,int b,int &c){
    c = a+b;
}

// (2) 整数の配列(std::vector)を引数で受け取り，その合計を返す関数 sum
void sum(vector<int> v,int &c){
    c = 0;
    for(int i = 0;i < v.size();i++){
        c += v[i];
    }
}


// (3) 二つの文字列(std::string)を引数で受け取り，連結された文字列を返す関数 sum
void sum(string s1,string s2,string &s){
    s = "";
    s = s1 + s2;
}
int main (void)
{
    // (1)用の変数の定義
    int    a, b, c;

    // (2)用の変数の定義
    int    x(5);
    std::vector<int>    v;

    // (3)用の変数の定義
    std::string    s1, s2, s;

    //------------------------------------------------
    // (1)のsum関数の確認: 二つの整数をキー入力して，それぞれa,bに記憶する．
    std::cout << "(1)のsumの確認" << std::endl;
    cout << ">>>a=";
    cin >> a;
    cout << ">>>b=";
    cin >> b;
    // aとbの和をsum関数で求め c に記憶する．
    sum(a,b,c);
    std::cout << "c = sum(a,b) = " << c << std::endl;

    //------------------------------------------------
    // (2)のsum関数の確認: 5整数をキー入力して，配列(std::vector)に記憶する．
    std::cout << "\n(2)のsumの確認" << std::endl;
    cout << "v[0]=";
    cin >> x;
    v.push_back(x);
    cout << "v[1]=";
    cin >> x;
    v.push_back(x);
    cout << "v[2]=";
    cin >> x;
    v.push_back(x);
    cout << "v[3]=";
    cin >> x;
    v.push_back(x);
    cout << "v[4]=";
    cin >> x;
    v.push_back(x);
    // vに記憶された整数の合計をsum関数で計算して c に記憶する．
    sum(v,c);
    std::cout << "c = sum(v) = " << c << std::endl;

    //------------------------------------------------
    // (3)のsum関数の確認: 二つの文字列をキー入力して，それぞれs1,s2に記憶する．
    std::cout << "\n(3)のsumの確認" << std::endl;
    cout << ">>>s1=";
    cin >> s1;
    cout << ">>>s2=";
    cin >> s2;
    // s1,s2の和(=文字列の連結とする)をsum関数で求め s に記憶する．
    sum(s1,s2,s);
    std::cout << "s = sum(s1,s2) = \"" << s << "\"" << std::endl;

    return 0;
}


/* 実行結果 ========================================================================================
(1)のsumの確認
>>>a=3
>>>b=9
c = sum(a,b) = 12

(2)のsumの確認
v[0]=5
v[1]=6
v[2]=7
v[3]=8
v[4]=9
c = sum(v) = 35

(3)のsumの確認
>>>s1=ABC
>>>s2=DEF
s = sum(s1,s2) = "ABCDEF"
==================================================================================================*/
