/* 2025年度 プログラミング応用演習 第3回 演習プログラム(1) - PAE03_exer1
====================================================================================================
■キー入力された2実数x,yの四則演算を求めるプログラム
・四則演算部分を関数にする．関数名はoperationsとし，戻り値はvoid型とする．
  引数は各自考えること．ただし，最初の二つは演算対象となる2実数とする．
・0除算のエラーは，例外処理で対応すること．
  関数operations内で例外("devided by 0"を送出，呼び出し側(main)で検知するものとする．
==================================================================================================*/
#include <iostream>
using namespace std;
// 与えられた2数の四則演算を求める関数operationsの定義
void operations(float x, float y,float &add,float &sub,float &mul,float &div)
{
  add = x+y;
  sub = x-y;
  mul = x*y;
  if (y==0){
    throw "devided by 0";
  }
  div = x/y;
}

//==================================================================================================
int main(void)
{
	float  x, y;	// 入力値を記憶する変数
	float  add, sub, mul, div;		// 演算結果(加減乗除)を記憶する変数

  // キー入力された値を2整数に格納する
  cout << ">>>x=";
  cin >> x;
  cout << ">>>y=";
  cin >> y;

	// 四則演算関数operationsを呼び出し，結果を表示する．
	// operationsが例外を送出する可能性があるので，検出できるようにする．
  try{
    operations(x,y,add,sub,mul,div);
    cout << "x + y = " << add << endl << "x - y = " << sub << endl << "x * y = " << mul << endl << "x / y = " << div << endl;
  } catch (char const*){
    cout << "Error: devided by 0";
  }
    return 0;
}


/* 実行結果 ========================================================================================

[2数が5と3の場合]
>>>x=5
>>>y=3
x + y = 8
x - y = 2
x * y = 15
x / y = 1.66667
----------------------------------------------------------------------------------------------------
[0除算の場合]
>>>x=5
>>>y=0
Error: devided by 0
==================================================================================================*/
